; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
; params: miconic -f 9 -p 7 -r 991816852






(define (problem mixed-f9-p7-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)

(above f5 f6)
(above f5 f7)
(above f5 f8)

(above f6 f7)
(above f6 f8)

(above f7 f8)



(origin p0 f2)
(destin p0 f4)

(origin p1 f5)
(destin p1 f8)

(origin p2 f0)
(destin p2 f4)

(origin p3 f5)
(destin p3 f4)

(origin p4 f6)
(destin p4 f1)

(origin p5 f3)
(destin p5 f1)

(origin p6 f0)
(destin p6 f2)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
))
)

; plan
1. (board f0 p6)
   added: (boarded p6)
   goals met: 0 of 7
2. (board f0 p2)
   added: (boarded p2)
   goals met: 0 of 7
3. (up f0 f8)
   deleted: (lift-at f0)
   added: (lift-at f8)
   goals met: 0 of 7
4. (down f8 f6)
   deleted: (lift-at f8)
   added: (lift-at f6)
   goals met: 0 of 7
5. (board f6 p4)
   added: (boarded p4)
   goals met: 0 of 7
6. (up f6 f8)
   deleted: (lift-at f6)
   added: (lift-at f8)
   goals met: 0 of 7
7. (down f8 f5)
   deleted: (lift-at f8)
   added: (lift-at f5)
   goals met: 0 of 7
8. (board f5 p3)
   added: (boarded p3)
   goals met: 0 of 7
9. (board f5 p1)
   added: (boarded p1)
   goals met: 0 of 7
10. (up f5 f8)
   deleted: (lift-at f5)
   added: (lift-at f8)
   goals met: 0 of 7
11. (depart f8 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 7
12. (down f8 f4)
   deleted: (lift-at f8)
   added: (lift-at f4)
   goals met: 1 of 7
13. (depart f4 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 7
14. (depart f4 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 7
15. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 3 of 7
16. (board f3 p5)
   added: (boarded p5)
   goals met: 3 of 7
17. (up f3 f4)
   deleted: (lift-at f3)
   added: (lift-at f4)
   goals met: 3 of 7
18. (down f4 f2)
   deleted: (lift-at f4)
   added: (lift-at f2)
   goals met: 3 of 7
19. (depart f2 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 4 of 7
20. (board f2 p0)
   added: (boarded p0)
   goals met: 4 of 7
21. (up f2 f4)
   deleted: (lift-at f2)
   added: (lift-at f4)
   goals met: 4 of 7
22. (depart f4 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 5 of 7
23. (down f4 f1)
   deleted: (lift-at f4)
   added: (lift-at f1)
   goals met: 5 of 7
24. (depart f1 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 6 of 7
25. (depart f1 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 7 of 7
